Bookers2/app/controllers/books_controller.rb

  def create
        @book = Book.new(book_params)
        @book.user_id = current_user.id
        if @book.save
            flash[:notice] = "successfully."
            redirect_to book_path(@book)
        else
            flash[:notice] = "error"
            @books = Book.all
---
INSERT INTO "books" ("user_id", "title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 2], ["title", "v2h9s"], ["body", "3pw57q5galyfiyfvcg5h"], ["created_at", "2021-01-22 11:06:16.562889"], ["updated_at", "2021-01-22 11:06:16.562889"]]
SELECT "books".* FROM "books"

  def show
      @book = Book.new
		  @bookdetail = Book.find(params[:id])
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]