Bookers2/app/controllers/users_controller.rb

  def update
    @user = User.find(params[:id])
    if @user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "users" SET "name" = ?, "introduction" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "im9lwa9zk"], ["introduction", "058usno0394rd0ov2b4"], ["updated_at", "2021-01-22 11:06:22.056640"], ["id", 2]]